Show / Hide Table of Contents
Class StagedCheckSection
Single check section
Inheritance
System.Object
OpenObject
OpenElementId
CheckSection
StagedCheckSection
Inherited Members
 CheckSection.Description
 CheckSection.CheckMember
 CheckSection.ReinfSection
 CheckSection.Extremes
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.Concrete.SingleCheckProject.StagedSection,CI.SingleCheckProject", "CI.Services.Concrete.ServicePoint.ISingleCheckSection,CI.ServiceTypes", typeof(CheckSection))]
public class StagedCheckSection : CheckSection
Constructors
Improve this Doc   View Source
StagedCheckSection()
Constructor
Declaration
public StagedCheckSection()
Properties
Improve this Doc   View Source
StagesLoading
Stages loading
Declaration
public StagesLoading StagesLoading { get; set; }
Property Value
 Type |  Description
 StagesLoading
 Improve this Doc
 View Source